//
//  Questions.swift
//  Psychological test App
//
//  Created by Denis on 25.02.2022.
//

enum Statement: String, CaseIterable {
    case one = "1) Я стремлюсь изучить себя."
    case two = "2) Я оставляю время для развития, как бы ни был занят делами."
    case three = "3) Возникающие препятствия стимулируют мою активность."
    case four = "4) Я ищу обратную связь, так как это помогает мне узнать и оценить себя."
    case five = "5) Я рефлексирую свою деятельность, выделяя для этого специальное время."
    case six = "6) Я анализирую свои чувства и опыт."
    case seven = "7) Я много читаю."
    case eight = "8) Я широко дискутирую по интересующим меня вопросам."
    case nine = "9) Я верю в свои возможности."
    case ten = "10) Я стремлюсь быть более открытым человеком."
    case eleven = "11) Я осознаю то влияние, которое оказывают на меня окружающие люди."
    case twelve = "12) Я управляю своим профессиональным развитием и получаю положительные результаты."
    case thirdteen = "13) Я получаю удовольствие от освоения нового."
    case fourteen = "14) Возрастающая ответственность не пугает меня."
    case fifteen = "15) Я положительно отнес(лась)ся бы к продвижению по службе."    
}
